<?php
// index.php
// 変数：データにつけるラベル（変更可能）
// 定数：変更不可

define("ADMIN_EMAIL", "y-i-group@gmail.com");
define("LIST_COUNT", 15);

echo ADMIN_EMAIL;
echo '<br>';
echo LIST_COUNT;
echo '<br>';
echo '<br>';
echo "デプロイ"."<br>";
echo "開発したソフトウェアを実際の運用環境に配置・展開して実用に供すること。"."<br>";
echo "バリデーション"."<br>";
echo "対象がその仕様や文法などに照らして適切に記述・構築されているか否かを検証すること。"."<br>";
echo "アジャイル・ウォーターフォール（開発手法）"."<br>";
echo "1週間から1か月といった短期の反復期間内で、どんどん機能を追加していく「反復増加タイプ」の開発プロセスによって、アジャイル開発は進む。ウォータフォール開発は最初の企画の段階で、開発対象のソフトウェアの機能を全て決め、「企画」「設計」「実装」「テスト」のそれぞれの工程は決められた技術者が担当する。前の工程でドキュメントを作成し、次の工程へ引き継ぐ手法をとる。"."<br>";
?>